ХМНПФ_Общее/Documents/пдс_ОткрытиеДоговораПДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>пдс_ОткрытиеДоговораПДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПенсионныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пдс_ДоговорыПДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/ХМ_КасперДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХМ_КасперДокументы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>DOC_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Documents/пдс_ОткрытиеДоговораПДС/Ext/ObjectModule.bsl
Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ, СтруктураТЧ) Экспорт
	Если Проведен Тогда
	#Если Сервер Тогда
		Если ЗначениеЗаполнено(ПенсионныйДоговор) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ХМ_КасперДокументы.DOC_ID
				|ИЗ
				|	РегистрСведений.ХМ_КасперДокументы КАК ХМ_КасперДокументы
				|ГДЕ
				|	ХМ_КасперДокументы.Документ = &Документ";
			
			Запрос.УстановитьПараметр("Документ", ЭтотОбъект.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				DOC_ID = Выборка.DOC_ID;
			Иначе
				ВызватьИсключение "Для документа " + ЭтотОбъект.Ссылка + " не найден DOC_ID в РегистрСведений.ХМ_КасперДокументы";
			КонецЕсли;
			
			НЗ = РегистрыСведений.ХМ_КасперДокументыНПО.СоздатьНаборЗаписей();
			НЗ.ОбменДанными.Загрузка = Истина;
			НЗ.Отбор.DOC_ID.Установить(DOC_ID);
			НЗ.Прочитать();
			Если НЗ.Количество()=0 Тогда
				НовЗапись = НЗ.Добавить();
				НовЗапись.DOC_ID = DOC_ID;
			ИначеЕсли НЗ.Количество()=1 Тогда
				НовЗапись = НЗ[0];
			КонецЕсли;
			НовЗапись.Документ = ПенсионныйДоговор;
			НЗ.Записать();
		КонецЕсли;
	#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры
